Catalogs/БанкротствоИерархияСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>БанкротствоИерархияСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсходноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйПутьКДанным</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньИерархии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/БанкротствоИерархияСвойств/Ext/ManagerModule.bsl
Процедура ЗагрузитьИзМакетаЭлемены() Экспорт
	ТабДок = ПолучитьМакет("МакетБИС");	
	ПЗ = Новый ПостроительЗапроса;	
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДок.Область());	
	ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;	
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();	
	ТЗ = ПЗ.Результат.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.УровеньИерархии КАК УровеньИерархии,
		|	ТЗ.Наименование КАК Наименование,
		|	ТЗ.ИсходноеНаименование КАК ИсходноеНаименование,
		|	ТЗ.РодительПолныйПутьКДанным КАК РодительПолныйПутьКДанным,
		|	ТЗ.ПолныйПутьКДанным КАК ПолныйПутьКДанным
		|ПОМЕСТИТЬ ВТ_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЗ.УровеньИерархии КАК ТЗУровеньИерархии,
		|	ВТ_ТЗ.Наименование КАК ТЗНаименование,
		|	ВТ_ТЗ.ИсходноеНаименование КАК ТЗИсходноеНаименование,
		|	ВТ_ТЗ.ПолныйПутьКДанным КАК ТЗПолныйПутьКДанным,
		|	ВТ_ТЗ.РодительПолныйПутьКДанным КАК ТЗРодительПолныйПутьКДанным,
		|	БанкротствоИерархияСвойств.Ссылка КАК СпрСсылка,
		|	БанкротствоИерархияСвойств.Наименование КАК СпрНаименование
		|ИЗ
		|	ВТ_ТЗ КАК ВТ_ТЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанкротствоИерархияСвойств КАК БанкротствоИерархияСвойств
		|		ПО ВТ_ТЗ.ПолныйПутьКДанным = БанкротствоИерархияСвойств.ПолныйПутьКДанным
		|ГДЕ
		|	ВТ_ТЗ.УровеньИерархии > 1
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТЗ.РодительПолныйПутьКДанным,
		|	ВТ_ТЗ.УровеньИерархии,
		|	ВТ_ТЗ.Наименование,
		|	ВТ_ТЗ.ИсходноеНаименование,
		|	БанкротствоИерархияСвойств.Ссылка,
		|	БанкротствоИерархияСвойств.Наименование,
		|	ВТ_ТЗ.ПолныйПутьКДанным
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТЗУровеньИерархии";
	Запрос.УстановитьПараметр("ТЗ",ТЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СпрСсылка) И Выборка.ТЗНаименование <> Выборка.СпрНаименование Тогда
			Спр = Выборка.СпрСсылка.ПолучитьОбъект();
			Спр.Наименование = Выборка.ТЗНаименование;
			Спр.Записать(); 
		ИначеЕсли НЕ ЗначениеЗаполнено(Выборка.СпрСсылка) Тогда
			Спр = Справочники.БанкротствоИерархияСвойств.СоздатьЭлемент();
			Спр.Наименование = Выборка.ТЗНаименование;
			Спр.ИсходноеНаименование = Выборка.ТЗИсходноеНаименование;
			Спр.ПолныйПутьКДанным = Выборка.ТЗПолныйПутьКДанным;
			Спр.УровеньИерархии = Выборка.ТЗУровеньИерархии;
			Спр.Родитель = Справочники.БанкротствоИерархияСвойств.НайтиПоРеквизиту("ПолныйПутьКДанным",Выборка.ТЗРодительПолныйПутьКДанным);	
			Спр.Записать();
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры // ЗагрузитьИзМакетаЭлемены()
